wfs2/src/wfs.getFeatureWithLock.res.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xlink="http://www.w3.org/1999/xlink"
    xmlns:idls="http://inspire.ec.europa.eu/schemas/inspire_dls/1.0"
    xmlns:fes="http://www.opengis.net/fes/2.0"
    xmlns:icommon="http://inspire.ec.europa.eu/schemas/common/1.0"
    xmlns:util="http://www.opengis.net/wfs-util/2.0"
    xmlns:ows="http://www.opengis.net/ows/1.1"
    xmlns:f2i-plu="http://plu.fit2inspire.eu/"
    xmlns:wfs="http://www.opengis.net/wfs/2.0">
 <SOAP-ENV:Body>
  <wfs:FeatureCollection lockId="" timeStamp="2020-05-03T21:39:58Z" numberMatched="" numberReturned="0" next="http://www.example.com/schema/anyURI" previous="http://www.example.com/schema/anyURI">
   <wfs:additionalObjects>
    <wfs:ValueCollection timeStamp="2020-05-03T21:39:58Z" numberMatched="" numberReturned="0" next="http://www.example.com/schema/anyURI" previous="http://www.example.com/schema/anyURI">
     <!-- extensibility element(s) -->
     <wfs:member state="" xlink:type="simple" xlink:href="http://www.example.com/schema/anyURI" xlink:role="http://www.example.com/schema/anyURI" xlink:arcrole="http://www.example.com/schema/anyURI" xlink:title="" xlink:show="new" xlink:actuate="onLoad">
      <!-- extensibility element(s) -->
      <!-- extensibility element(s) -->
      <!-- extensibility element(s) -->
     </wfs:member>
     <wfs:additionalValues>
      <wfs:ValueCollection timeStamp="2020-05-03T21:39:58Z" numberMatched="" numberReturned="0" next="http://www.example.com/schema/anyURI" previous="http://www.example.com/schema/anyURI">
       <!-- extensibility element(s) -->
       <wfs:member state="" xlink:type="simple" xlink:href="http://www.example.com/schema/anyURI" xlink:role="http://www.example.com/schema/anyURI" xlink:arcrole="http://www.example.com/schema/anyURI" xlink:title="" xlink:show="new" xlink:actuate="onLoad">
        <!-- extensibility element(s) -->
        <!-- extensibility element(s) -->
        <!-- extensibility element(s) -->
       </wfs:member>
       <wfs:additionalValues>
        <wfs:ValueCollection timeStamp="2020-05-03T21:39:58Z" numberMatched="" numberReturned="0" next="http://www.example.com/schema/anyURI" previous="http://www.example.com/schema/anyURI">
         <!-- extensibility element(s) -->
        </wfs:ValueCollection>
       </wfs:additionalValues>
       <wfs:truncatedResponse>
        <ows:ExceptionReport version="" xml:lang="">
         <ows:Exception exceptionCode="" locator="">
          <!-- extensibility element(s) -->
         </ows:Exception>
        </ows:ExceptionReport>
       </wfs:truncatedResponse>
      </wfs:ValueCollection>
     </wfs:additionalValues>
     <wfs:truncatedResponse>
      <ows:ExceptionReport version="" xml:lang="">
       <ows:Exception exceptionCode="" locator="">
        <!-- extensibility element(s) -->
        <ows:ExceptionText></ows:ExceptionText>
       </ows:Exception>
      </ows:ExceptionReport>
     </wfs:truncatedResponse>
    </wfs:ValueCollection>
   </wfs:additionalObjects>
   <wfs:truncatedResponse>
    <ows:ExceptionReport version="" xml:lang="">
     <ows:Exception exceptionCode="" locator="">
      <!-- extensibility element(s) -->
      <ows:ExceptionText></ows:ExceptionText>
     </ows:Exception>
    </ows:ExceptionReport>
   </wfs:truncatedResponse>
  </wfs:FeatureCollection>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
